backend/app/controllers/translations_controller.rb

INSERT INTO "translation_events" ("from", "to", "origin", "iterations", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def plsStore

    from = params[:from]
    to = params[:to]
    origin = params[:origin]
    iterations = params[:iterations]

    TranslationEvent.create(from: from,to:to,origin:origin,iterations:iterations)